[
  {
    "name": "Smartphone X",
    "image": "https://source.unsplash.com/random/500x500/?tech",
    "tags": ["mobile", "smartphone", "tech", "communication"],
    "upvoteCount": 27,
    "downvoteCount": 2,
    "timestamp": "2023-11-27",
    "shortDescription": "Powerful and sleek smartphone with advanced features.",
    "longDescription": "The Smartphone X is a cutting-edge device designed for seamless communication and advanced functionality. With a powerful processor, stunning display, and innovative features, it's the perfect companion for your busy lifestyle.",
    "productStatus": "pending"
  },
  {
    "name": "Laptop Pro",
    "image": "https://source.unsplash.com/random/500x500/?tech",
    "tags": ["laptop", "technology", "productivity", "computing"],
    "upvoteCount": 20,
    "downvoteCount": 5,
    "timestamp": "2023-11-27",
    "shortDescription": "High-performance laptop for professional use.",
    "longDescription": "Introducing the Laptop Pro, a powerhouse designed for professionals seeking top-notch performance. With a sleek design, high-resolution display, and advanced computing capabilities, it's your go-to device for productivity on the go.",
    "productStatus": "approved"
  },
  {
    "name": "Wireless Earbuds Pro",
    "image": "https://source.unsplash.com/random/500x500/?tech",
    "tags": ["audio", "earbuds", "wireless", "music"],
    "upvoteCount": 13,
    "downvoteCount": 3,
    "timestamp": "2023-11-27",
    "shortDescription": "Immersive sound experience with cutting-edge wireless technology.",
    "longDescription": "Experience music like never before with our Wireless Earbuds Pro. These earbuds deliver a truly immersive audio experience with the latest wireless technology, ensuring crystal-clear sound and ultimate comfort for extended listening sessions.",
    "productStatus": "approved"
  },
  {
    "name": "Gaming Console X",
    "image": "https://source.unsplash.com/random/500x500/?tech",
    "tags": ["gaming", "console", "entertainment", "technology"],
    "upvoteCount": 27,
    "downvoteCount": 6,
    "timestamp": "2023-11-27",
    "shortDescription": "Next-gen gaming console for an unparalleled gaming experience.",
    "longDescription": "Immerse yourself in the world of gaming with the Gaming Console X. Boasting next-gen graphics and powerful performance, this console delivers an unparalleled gaming experience. Get ready for breathtaking visuals and responsive gameplay like never before.",
    "productStatus": "approved"
  },
  {
    "name": "Smart Watch Pro",
    "image": "https://source.unsplash.com/random/500x500/?tech",
    "tags": ["wearable", "smartwatch", "fitness", "health"],
    "upvoteCount": 18,
    "downvoteCount": 4,
    "timestamp": "2023-11-27",
    "shortDescription": "Advanced smartwatch with health and fitness tracking features.",
    "longDescription": "Elevate your fitness journey with the Smart Watch Pro. This advanced smartwatch not only keeps you connected but also monitors your health and fitness in real-time. Stay motivated with personalized insights and achieve your wellness goals effortlessly.",
    "productStatus": "approved"
  },
  {
    "name": "Apple Watch",
    "image": "https://source.unsplash.com/black-smart-watch-with-black-strap-2wFoa040m8g",
    "tags": ["tech", "Watch", "Apple"],
    "upvoteCount": 11,
    "downvoteCount": 6,
    "timestamp": "11/28/2023",
    "shortDescription": "The new apple smart watch",
    "longDescription": "The Apple Watch is a sleek and sophisticated smartwatch designed to seamlessly integrate with your active lifestyle. Offering a harmonious blend of fashion and functionality, this innovative device serves as an extension of your iPhone, providing instant access to notifications, fitness tracking, and a myriad of apps right from your wrist. With a stunning Retina display, advanced health monitoring features, and a customizable design, the Apple Watch is not just a timepiece but a versatile companion that empowers you to stay connected, motivated, and in control throughout your day.",
    "productStatus": "approved"
  },
  {
    "name": "Realme 5i",
    "image": "https://source.unsplash.com/white-smartphone-near-laptop-xsGxhtAsfSA",
    "tags": ["tech", "phone", "New"],
    "upvoteCount": 4,
    "downvoteCount": 5,
    "timestamp": "11/28/2023",
    "shortDescription": "A world of difference.",
    "longDescription": "The Realme 5i is a budget-friendly smartphone that combines impressive features with affordability. Boasting a sleek and modern design, the device features a 6.5-inch IPS LCD display with a resolution of 720 x 1600 pixels, providing vibrant colors and sharp visuals for an immersive viewing experience.",
    "productStatus": "approved"
  },
  {
    "name": "iphone X",
    "image": "https://source.unsplash.com/silver-iphone-x-floating-over-open-palm-6wdRuK7bVTE",
    "tags": ["tech", "phone", "iphone", "apple"],
    "upvoteCount": 6,
    "downvoteCount": 6,
    "timestamp": "11/28/2023",
    "shortDescription": "The iPhone X is a milestone in smartphone design, featuring an edge-to-edge Super Retina display, Face ID authentication, and a dual-camera system for advanced photography.",
    "longDescription": " The iPhone X, released in 2017, is a groundbreaking smartphone by Apple that marked the 10th anniversary of the iPhone series. It features a stunning 5.8-inch Super Retina display with OLED technology, providing vibrant colors and deep blacks. The phone's design is characterized by its edge-to-edge display and the absence of a physical home button, replaced by Face ID facial recognition for secure authentication. Powered by the A11 Bionic chip, the iPhone X delivers impressive performance and supports augmented reality experiences. Its dual-camera system on the back enables advanced photography capabilities, including Portrait mode and optical zoom. With a sleek glass and stainless-steel construction, the iPhone X embodies a modern and premium aesthetic, showcasing Apple's commitment to innovation in both design and technology.",
    "productStatus": "approved"
  },
  {
    "name": "Macbook Air",
    "image": "https://source.unsplash.com/macbook-pro-on-white-table-35DopK36wzw",
    "tags": ["tech", "laptop", "macBook", "Apple"],
    "upvoteCount": 0,
    "downvoteCount": 0,
    "timestamp": "11/28/2023",
    "shortDescription": "The MacBook Air is a sleek and lightweight laptop, known for its stunning Retina display, powerful performance, and all-day battery life.",
    "longDescription": "The MacBook Air is a flagship laptop from Apple, renowned for its exceptional combination of portability and performance. With a razor-thin design, it features a brilliant Retina display that brings content to life with vibrant colors and sharp details. The MacBook Air is powered by Apple's custom M1 chip, delivering impressive speed and efficiency for everyday tasks and creative endeavors. Its Magic Keyboard ensures a comfortable and responsive typing experience, while the Force Touch trackpad enhances navigation. Equipped with all-day battery life, the MacBook Air is the perfect companion for professionals, students, and anyone seeking a premium computing experience in a compact form factor. Whether you're working on documents, editing photos, or streaming content, the MacBook Air seamlessly blends power and style in a portable package.",
    "productStatus": "approved"
  }
]
